case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/system/caseParameters"

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform ($Uinf 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"   // cyclicAMI etc.

    inlet       { type fixedValue; value uniform ($Uinf 0 0); }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }
    tunnelWalls { type slip; }
    "(blades|hub)"
    {
        // no-slip on a moving wall: fluid velocity = wall velocity (omega x r)
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
