case/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/system/caseParameters"

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform $kInlet;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet       { type fixedValue; value $internalField; }
    outlet      { type inletOutlet; inletValue $internalField; value $internalField; }
    tunnelWalls { type zeroGradient; }
    "(blades|hub)" { type kqRWallFunction; value $internalField; }
}

// ************************************************************************* //
