case/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet       { type calculated; value uniform 0; }
    outlet      { type calculated; value uniform 0; }
    tunnelWalls { type calculated; value uniform 0; }
    // Spalding's law: continuous from viscous sublayer to log layer (y+ 1 ... 300)
    "(blades|hub)" { type nutUSpaldingWallFunction; value uniform 0; }
}

// ************************************************************************* //
