case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "meshParameters"

solvers
{
    "pcorr.*"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-3;
        relTol          0;
        cacheAgglomeration no;      // mesh moves -> AMI weights change
    }
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.05;
        cacheAgglomeration no;
        nCellsInCoarsestLevel 50;
    }
    pFinal
    {
        $p;
        tolerance       1e-6;
        relTol          0;
    }
    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
    }
    "(U|k|omega)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    $nOuter;
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;
    correctPhi          yes;        // keep fluxes conservative after AMI motion
    moveMeshOuterCorrectors no;
    pRefCell            0;
    pRefValue           0;
}

relaxationFactors
{
    equations
    {
        "U"             0.8;
        "(k|omega)"     0.7;
        ".*Final"       1;
    }
}

// ************************************************************************* //
