case/system/functions/inductionLines
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/functions";
    object      inductionLines;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Mean flow along lines through the induction zone and wake (written at writeTime).
inductionLines
{
    type            sets;
    libs            (sampling);
    writeControl    writeTime;
    timeStart       $tAvgStart;
    setFormat       csv;
    interpolationScheme cellPoint;
    fields          (UMean pMean);

    // explicit point lists (not 'uniform'): particle tracking across AMI is not
    // supported in parallel, cell search is.
    sets
    {
        axisUpstream    // centreline from inlet to spinner nose
        {
            type    cloud;
            axis    x;
            points
            (
                (-1.80000 0.00000 0.00000)
                (-1.78576 0.00000 0.00000)
                (-1.77151 0.00000 0.00000)
                (-1.75727 0.00000 0.00000)
                (-1.74303 0.00000 0.00000)
                (-1.72878 0.00000 0.00000)
                (-1.71454 0.00000 0.00000)
                (-1.70029 0.00000 0.00000)
                (-1.68605 0.00000 0.00000)
                (-1.67181 0.00000 0.00000)
                (-1.65756 0.00000 0.00000)
                (-1.64332 0.00000 0.00000)
                (-1.62908 0.00000 0.00000)
                (-1.61483 0.00000 0.00000)
                (-1.60059 0.00000 0.00000)
                (-1.58634 0.00000 0.00000)
                (-1.57210 0.00000 0.00000)
                (-1.55786 0.00000 0.00000)
                (-1.54361 0.00000 0.00000)
                (-1.52937 0.00000 0.00000)
                (-1.51513 0.00000 0.00000)
                (-1.50088 0.00000 0.00000)
                (-1.48664 0.00000 0.00000)
                (-1.47239 0.00000 0.00000)
                (-1.45815 0.00000 0.00000)
                (-1.44391 0.00000 0.00000)
                (-1.42966 0.00000 0.00000)
                (-1.41542 0.00000 0.00000)
                (-1.40118 0.00000 0.00000)
                (-1.38693 0.00000 0.00000)
                (-1.37269 0.00000 0.00000)
                (-1.35845 0.00000 0.00000)
                (-1.34420 0.00000 0.00000)
                (-1.32996 0.00000 0.00000)
                (-1.31571 0.00000 0.00000)
                (-1.30147 0.00000 0.00000)
                (-1.28723 0.00000 0.00000)
                (-1.27298 0.00000 0.00000)
                (-1.25874 0.00000 0.00000)
                (-1.24450 0.00000 0.00000)
                (-1.23025 0.00000 0.00000)
                (-1.21601 0.00000 0.00000)
                (-1.20176 0.00000 0.00000)
                (-1.18752 0.00000 0.00000)
                (-1.17328 0.00000 0.00000)
                (-1.15903 0.00000 0.00000)
                (-1.14479 0.00000 0.00000)
                (-1.13055 0.00000 0.00000)
                (-1.11630 0.00000 0.00000)
                (-1.10206 0.00000 0.00000)
                (-1.08782 0.00000 0.00000)
                (-1.07357 0.00000 0.00000)
                (-1.05933 0.00000 0.00000)
                (-1.04508 0.00000 0.00000)
                (-1.03084 0.00000 0.00000)
                (-1.01660 0.00000 0.00000)
                (-1.00235 0.00000 0.00000)
                (-0.98811 0.00000 0.00000)
                (-0.97387 0.00000 0.00000)
                (-0.95962 0.00000 0.00000)
                (-0.94538 0.00000 0.00000)
                (-0.93113 0.00000 0.00000)
                (-0.91689 0.00000 0.00000)
                (-0.90265 0.00000 0.00000)
                (-0.88840 0.00000 0.00000)
                (-0.87416 0.00000 0.00000)
                (-0.85992 0.00000 0.00000)
                (-0.84567 0.00000 0.00000)
                (-0.83143 0.00000 0.00000)
                (-0.81718 0.00000 0.00000)
                (-0.80294 0.00000 0.00000)
                (-0.78870 0.00000 0.00000)
                (-0.77445 0.00000 0.00000)
                (-0.76021 0.00000 0.00000)
                (-0.74597 0.00000 0.00000)
                (-0.73172 0.00000 0.00000)
                (-0.71748 0.00000 0.00000)
                (-0.70324 0.00000 0.00000)
                (-0.68899 0.00000 0.00000)
                (-0.67475 0.00000 0.00000)
                (-0.66050 0.00000 0.00000)
                (-0.64626 0.00000 0.00000)
                (-0.63202 0.00000 0.00000)
                (-0.61777 0.00000 0.00000)
                (-0.60353 0.00000 0.00000)
                (-0.58929 0.00000 0.00000)
                (-0.57504 0.00000 0.00000)
                (-0.56080 0.00000 0.00000)
                (-0.54655 0.00000 0.00000)
                (-0.53231 0.00000 0.00000)
                (-0.51807 0.00000 0.00000)
                (-0.50382 0.00000 0.00000)
                (-0.48958 0.00000 0.00000)
                (-0.47534 0.00000 0.00000)
                (-0.46109 0.00000 0.00000)
                (-0.44685 0.00000 0.00000)
                (-0.43261 0.00000 0.00000)
                (-0.41836 0.00000 0.00000)
                (-0.40412 0.00000 0.00000)
                (-0.38987 0.00000 0.00000)
                (-0.37563 0.00000 0.00000)
                (-0.36139 0.00000 0.00000)
                (-0.34714 0.00000 0.00000)
                (-0.33290 0.00000 0.00000)
                (-0.31866 0.00000 0.00000)
                (-0.30441 0.00000 0.00000)
                (-0.29017 0.00000 0.00000)
                (-0.27592 0.00000 0.00000)
                (-0.26168 0.00000 0.00000)
                (-0.24744 0.00000 0.00000)
                (-0.23319 0.00000 0.00000)
                (-0.21895 0.00000 0.00000)
                (-0.20471 0.00000 0.00000)
                (-0.19046 0.00000 0.00000)
                (-0.17622 0.00000 0.00000)
                (-0.16197 0.00000 0.00000)
                (-0.14773 0.00000 0.00000)
                (-0.13349 0.00000 0.00000)
                (-0.11924 0.00000 0.00000)
                (-0.10500 0.00000 0.00000)
            );
        }
        span70    // r = 0.7R through rotor and wake (instantaneous azimuth averaged by UMean)
        {
            type    cloud;
            axis    x;
            points
            (
                (-1.80000 0.00000 0.31500)
                (-1.76987 0.00000 0.31500)
                (-1.73975 0.00000 0.31500)
                (-1.70962 0.00000 0.31500)
                (-1.67950 0.00000 0.31500)
                (-1.64937 0.00000 0.31500)
                (-1.61925 0.00000 0.31500)
                (-1.58912 0.00000 0.31500)
                (-1.55900 0.00000 0.31500)
                (-1.52887 0.00000 0.31500)
                (-1.49874 0.00000 0.31500)
                (-1.46862 0.00000 0.31500)
                (-1.43849 0.00000 0.31500)
                (-1.40837 0.00000 0.31500)
                (-1.37824 0.00000 0.31500)
                (-1.34812 0.00000 0.31500)
                (-1.31799 0.00000 0.31500)
                (-1.28787 0.00000 0.31500)
                (-1.25774 0.00000 0.31500)
                (-1.22762 0.00000 0.31500)
                (-1.19749 0.00000 0.31500)
                (-1.16736 0.00000 0.31500)
                (-1.13724 0.00000 0.31500)
                (-1.10711 0.00000 0.31500)
                (-1.07699 0.00000 0.31500)
                (-1.04686 0.00000 0.31500)
                (-1.01674 0.00000 0.31500)
                (-0.98661 0.00000 0.31500)
                (-0.95649 0.00000 0.31500)
                (-0.92636 0.00000 0.31500)
                (-0.89623 0.00000 0.31500)
                (-0.86611 0.00000 0.31500)
                (-0.83598 0.00000 0.31500)
                (-0.80586 0.00000 0.31500)
                (-0.77573 0.00000 0.31500)
                (-0.74561 0.00000 0.31500)
                (-0.71548 0.00000 0.31500)
                (-0.68536 0.00000 0.31500)
                (-0.65523 0.00000 0.31500)
                (-0.62510 0.00000 0.31500)
                (-0.59498 0.00000 0.31500)
                (-0.56485 0.00000 0.31500)
                (-0.53473 0.00000 0.31500)
                (-0.50460 0.00000 0.31500)
                (-0.47448 0.00000 0.31500)
                (-0.44435 0.00000 0.31500)
                (-0.41423 0.00000 0.31500)
                (-0.38410 0.00000 0.31500)
                (-0.35397 0.00000 0.31500)
                (-0.32385 0.00000 0.31500)
                (-0.29372 0.00000 0.31500)
                (-0.26360 0.00000 0.31500)
                (-0.23347 0.00000 0.31500)
                (-0.20335 0.00000 0.31500)
                (-0.17322 0.00000 0.31500)
                (-0.14310 0.00000 0.31500)
                (-0.11297 0.00000 0.31500)
                (-0.08285 0.00000 0.31500)
                (-0.05272 0.00000 0.31500)
                (-0.02259 0.00000 0.31500)
                (0.00753 0.00000 0.31500)
                (0.03766 0.00000 0.31500)
                (0.06778 0.00000 0.31500)
                (0.09791 0.00000 0.31500)
                (0.12803 0.00000 0.31500)
                (0.15816 0.00000 0.31500)
                (0.18828 0.00000 0.31500)
                (0.21841 0.00000 0.31500)
                (0.24854 0.00000 0.31500)
                (0.27866 0.00000 0.31500)
                (0.30879 0.00000 0.31500)
                (0.33891 0.00000 0.31500)
                (0.36904 0.00000 0.31500)
                (0.39916 0.00000 0.31500)
                (0.42929 0.00000 0.31500)
                (0.45941 0.00000 0.31500)
                (0.48954 0.00000 0.31500)
                (0.51967 0.00000 0.31500)
                (0.54979 0.00000 0.31500)
                (0.57992 0.00000 0.31500)
                (0.61004 0.00000 0.31500)
                (0.64017 0.00000 0.31500)
                (0.67029 0.00000 0.31500)
                (0.70042 0.00000 0.31500)
                (0.73054 0.00000 0.31500)
                (0.76067 0.00000 0.31500)
                (0.79079 0.00000 0.31500)
                (0.82092 0.00000 0.31500)
                (0.85105 0.00000 0.31500)
                (0.88117 0.00000 0.31500)
                (0.91130 0.00000 0.31500)
                (0.94142 0.00000 0.31500)
                (0.97155 0.00000 0.31500)
                (1.00167 0.00000 0.31500)
                (1.03180 0.00000 0.31500)
                (1.06192 0.00000 0.31500)
                (1.09205 0.00000 0.31500)
                (1.12218 0.00000 0.31500)
                (1.15230 0.00000 0.31500)
                (1.18243 0.00000 0.31500)
                (1.21255 0.00000 0.31500)
                (1.24268 0.00000 0.31500)
                (1.27280 0.00000 0.31500)
                (1.30293 0.00000 0.31500)
                (1.33305 0.00000 0.31500)
                (1.36318 0.00000 0.31500)
                (1.39331 0.00000 0.31500)
                (1.42343 0.00000 0.31500)
                (1.45356 0.00000 0.31500)
                (1.48368 0.00000 0.31500)
                (1.51381 0.00000 0.31500)
                (1.54393 0.00000 0.31500)
                (1.57406 0.00000 0.31500)
                (1.60418 0.00000 0.31500)
                (1.63431 0.00000 0.31500)
                (1.66444 0.00000 0.31500)
                (1.69456 0.00000 0.31500)
                (1.72469 0.00000 0.31500)
                (1.75481 0.00000 0.31500)
                (1.78494 0.00000 0.31500)
                (1.81506 0.00000 0.31500)
                (1.84519 0.00000 0.31500)
                (1.87531 0.00000 0.31500)
                (1.90544 0.00000 0.31500)
                (1.93556 0.00000 0.31500)
                (1.96569 0.00000 0.31500)
                (1.99582 0.00000 0.31500)
                (2.02594 0.00000 0.31500)
                (2.05607 0.00000 0.31500)
                (2.08619 0.00000 0.31500)
                (2.11632 0.00000 0.31500)
                (2.14644 0.00000 0.31500)
                (2.17657 0.00000 0.31500)
                (2.20669 0.00000 0.31500)
                (2.23682 0.00000 0.31500)
                (2.26695 0.00000 0.31500)
                (2.29707 0.00000 0.31500)
                (2.32720 0.00000 0.31500)
                (2.35732 0.00000 0.31500)
                (2.38745 0.00000 0.31500)
                (2.41757 0.00000 0.31500)
                (2.44770 0.00000 0.31500)
                (2.47782 0.00000 0.31500)
                (2.50795 0.00000 0.31500)
                (2.53808 0.00000 0.31500)
                (2.56820 0.00000 0.31500)
                (2.59833 0.00000 0.31500)
                (2.62845 0.00000 0.31500)
                (2.65858 0.00000 0.31500)
                (2.68870 0.00000 0.31500)
                (2.71883 0.00000 0.31500)
                (2.74895 0.00000 0.31500)
                (2.77908 0.00000 0.31500)
                (2.80921 0.00000 0.31500)
                (2.83933 0.00000 0.31500)
                (2.86946 0.00000 0.31500)
                (2.89958 0.00000 0.31500)
                (2.92971 0.00000 0.31500)
                (2.95983 0.00000 0.31500)
                (2.98996 0.00000 0.31500)
                (3.02008 0.00000 0.31500)
                (3.05021 0.00000 0.31500)
                (3.08033 0.00000 0.31500)
                (3.11046 0.00000 0.31500)
                (3.14059 0.00000 0.31500)
                (3.17071 0.00000 0.31500)
                (3.20084 0.00000 0.31500)
                (3.23096 0.00000 0.31500)
                (3.26109 0.00000 0.31500)
                (3.29121 0.00000 0.31500)
                (3.32134 0.00000 0.31500)
                (3.35146 0.00000 0.31500)
                (3.38159 0.00000 0.31500)
                (3.41172 0.00000 0.31500)
                (3.44184 0.00000 0.31500)
                (3.47197 0.00000 0.31500)
                (3.50209 0.00000 0.31500)
                (3.53222 0.00000 0.31500)
                (3.56234 0.00000 0.31500)
                (3.59247 0.00000 0.31500)
                (3.62259 0.00000 0.31500)
                (3.65272 0.00000 0.31500)
                (3.68285 0.00000 0.31500)
                (3.71297 0.00000 0.31500)
                (3.74310 0.00000 0.31500)
                (3.77322 0.00000 0.31500)
                (3.80335 0.00000 0.31500)
                (3.83347 0.00000 0.31500)
                (3.86360 0.00000 0.31500)
                (3.89372 0.00000 0.31500)
                (3.92385 0.00000 0.31500)
                (3.95397 0.00000 0.31500)
                (3.98410 0.00000 0.31500)
                (4.01423 0.00000 0.31500)
                (4.04435 0.00000 0.31500)
                (4.07448 0.00000 0.31500)
                (4.10460 0.00000 0.31500)
                (4.13473 0.00000 0.31500)
                (4.16485 0.00000 0.31500)
                (4.19498 0.00000 0.31500)
                (4.22510 0.00000 0.31500)
                (4.25523 0.00000 0.31500)
                (4.28536 0.00000 0.31500)
                (4.31548 0.00000 0.31500)
                (4.34561 0.00000 0.31500)
                (4.37573 0.00000 0.31500)
                (4.40586 0.00000 0.31500)
                (4.43598 0.00000 0.31500)
                (4.46611 0.00000 0.31500)
                (4.49623 0.00000 0.31500)
                (4.52636 0.00000 0.31500)
                (4.55649 0.00000 0.31500)
                (4.58661 0.00000 0.31500)
                (4.61674 0.00000 0.31500)
                (4.64686 0.00000 0.31500)
                (4.67699 0.00000 0.31500)
                (4.70711 0.00000 0.31500)
                (4.73724 0.00000 0.31500)
                (4.76736 0.00000 0.31500)
                (4.79749 0.00000 0.31500)
                (4.82762 0.00000 0.31500)
                (4.85774 0.00000 0.31500)
                (4.88787 0.00000 0.31500)
                (4.91799 0.00000 0.31500)
                (4.94812 0.00000 0.31500)
                (4.97824 0.00000 0.31500)
                (5.00837 0.00000 0.31500)
                (5.03849 0.00000 0.31500)
                (5.06862 0.00000 0.31500)
                (5.09874 0.00000 0.31500)
                (5.12887 0.00000 0.31500)
                (5.15900 0.00000 0.31500)
                (5.18912 0.00000 0.31500)
                (5.21925 0.00000 0.31500)
                (5.24937 0.00000 0.31500)
                (5.27950 0.00000 0.31500)
                (5.30962 0.00000 0.31500)
                (5.33975 0.00000 0.31500)
                (5.36987 0.00000 0.31500)
                (5.40000 0.00000 0.31500)
            );
        }
        rotorPlaneMinus    // radial traverse just upstream of the blades
        {
            type    cloud;
            axis    z;
            points
            (
                (-0.05000 0.00000 0.04600)
                (-0.05000 0.00000 0.05554)
                (-0.05000 0.00000 0.06509)
                (-0.05000 0.00000 0.07463)
                (-0.05000 0.00000 0.08418)
                (-0.05000 0.00000 0.09372)
                (-0.05000 0.00000 0.10327)
                (-0.05000 0.00000 0.11281)
                (-0.05000 0.00000 0.12235)
                (-0.05000 0.00000 0.13190)
                (-0.05000 0.00000 0.14144)
                (-0.05000 0.00000 0.15099)
                (-0.05000 0.00000 0.16053)
                (-0.05000 0.00000 0.17008)
                (-0.05000 0.00000 0.17962)
                (-0.05000 0.00000 0.18916)
                (-0.05000 0.00000 0.19871)
                (-0.05000 0.00000 0.20825)
                (-0.05000 0.00000 0.21780)
                (-0.05000 0.00000 0.22734)
                (-0.05000 0.00000 0.23689)
                (-0.05000 0.00000 0.24643)
                (-0.05000 0.00000 0.25597)
                (-0.05000 0.00000 0.26552)
                (-0.05000 0.00000 0.27506)
                (-0.05000 0.00000 0.28461)
                (-0.05000 0.00000 0.29415)
                (-0.05000 0.00000 0.30370)
                (-0.05000 0.00000 0.31324)
                (-0.05000 0.00000 0.32278)
                (-0.05000 0.00000 0.33233)
                (-0.05000 0.00000 0.34187)
                (-0.05000 0.00000 0.35142)
                (-0.05000 0.00000 0.36096)
                (-0.05000 0.00000 0.37051)
                (-0.05000 0.00000 0.38005)
                (-0.05000 0.00000 0.38959)
                (-0.05000 0.00000 0.39914)
                (-0.05000 0.00000 0.40868)
                (-0.05000 0.00000 0.41823)
                (-0.05000 0.00000 0.42777)
                (-0.05000 0.00000 0.43732)
                (-0.05000 0.00000 0.44686)
                (-0.05000 0.00000 0.45641)
                (-0.05000 0.00000 0.46595)
                (-0.05000 0.00000 0.47549)
                (-0.05000 0.00000 0.48504)
                (-0.05000 0.00000 0.49458)
                (-0.05000 0.00000 0.50413)
                (-0.05000 0.00000 0.51367)
                (-0.05000 0.00000 0.52322)
                (-0.05000 0.00000 0.53276)
                (-0.05000 0.00000 0.54230)
                (-0.05000 0.00000 0.55185)
                (-0.05000 0.00000 0.56139)
                (-0.05000 0.00000 0.57094)
                (-0.05000 0.00000 0.58048)
                (-0.05000 0.00000 0.59003)
                (-0.05000 0.00000 0.59957)
                (-0.05000 0.00000 0.60911)
                (-0.05000 0.00000 0.61866)
                (-0.05000 0.00000 0.62820)
                (-0.05000 0.00000 0.63775)
                (-0.05000 0.00000 0.64729)
                (-0.05000 0.00000 0.65684)
                (-0.05000 0.00000 0.66638)
                (-0.05000 0.00000 0.67592)
                (-0.05000 0.00000 0.68547)
                (-0.05000 0.00000 0.69501)
                (-0.05000 0.00000 0.70456)
                (-0.05000 0.00000 0.71410)
                (-0.05000 0.00000 0.72365)
                (-0.05000 0.00000 0.73319)
                (-0.05000 0.00000 0.74273)
                (-0.05000 0.00000 0.75228)
                (-0.05000 0.00000 0.76182)
                (-0.05000 0.00000 0.77137)
                (-0.05000 0.00000 0.78091)
                (-0.05000 0.00000 0.79046)
                (-0.05000 0.00000 0.80000)
            );
        }
        wake1D    // radial traverse 1 D downstream (published wake-traverse location)
        {
            type    cloud;
            axis    z;
            points
            (
                (0.90000 0.00000 -0.80000)
                (0.90000 0.00000 -0.78655)
                (0.90000 0.00000 -0.77311)
                (0.90000 0.00000 -0.75966)
                (0.90000 0.00000 -0.74622)
                (0.90000 0.00000 -0.73277)
                (0.90000 0.00000 -0.71933)
                (0.90000 0.00000 -0.70588)
                (0.90000 0.00000 -0.69244)
                (0.90000 0.00000 -0.67899)
                (0.90000 0.00000 -0.66555)
                (0.90000 0.00000 -0.65210)
                (0.90000 0.00000 -0.63866)
                (0.90000 0.00000 -0.62521)
                (0.90000 0.00000 -0.61176)
                (0.90000 0.00000 -0.59832)
                (0.90000 0.00000 -0.58487)
                (0.90000 0.00000 -0.57143)
                (0.90000 0.00000 -0.55798)
                (0.90000 0.00000 -0.54454)
                (0.90000 0.00000 -0.53109)
                (0.90000 0.00000 -0.51765)
                (0.90000 0.00000 -0.50420)
                (0.90000 0.00000 -0.49076)
                (0.90000 0.00000 -0.47731)
                (0.90000 0.00000 -0.46387)
                (0.90000 0.00000 -0.45042)
                (0.90000 0.00000 -0.43697)
                (0.90000 0.00000 -0.42353)
                (0.90000 0.00000 -0.41008)
                (0.90000 0.00000 -0.39664)
                (0.90000 0.00000 -0.38319)
                (0.90000 0.00000 -0.36975)
                (0.90000 0.00000 -0.35630)
                (0.90000 0.00000 -0.34286)
                (0.90000 0.00000 -0.32941)
                (0.90000 0.00000 -0.31597)
                (0.90000 0.00000 -0.30252)
                (0.90000 0.00000 -0.28908)
                (0.90000 0.00000 -0.27563)
                (0.90000 0.00000 -0.26218)
                (0.90000 0.00000 -0.24874)
                (0.90000 0.00000 -0.23529)
                (0.90000 0.00000 -0.22185)
                (0.90000 0.00000 -0.20840)
                (0.90000 0.00000 -0.19496)
                (0.90000 0.00000 -0.18151)
                (0.90000 0.00000 -0.16807)
                (0.90000 0.00000 -0.15462)
                (0.90000 0.00000 -0.14118)
                (0.90000 0.00000 -0.12773)
                (0.90000 0.00000 -0.11429)
                (0.90000 0.00000 -0.10084)
                (0.90000 0.00000 -0.08739)
                (0.90000 0.00000 -0.07395)
                (0.90000 0.00000 -0.06050)
                (0.90000 0.00000 -0.04706)
                (0.90000 0.00000 -0.03361)
                (0.90000 0.00000 -0.02017)
                (0.90000 0.00000 -0.00672)
                (0.90000 0.00000 0.00672)
                (0.90000 0.00000 0.02017)
                (0.90000 0.00000 0.03361)
                (0.90000 0.00000 0.04706)
                (0.90000 0.00000 0.06050)
                (0.90000 0.00000 0.07395)
                (0.90000 0.00000 0.08739)
                (0.90000 0.00000 0.10084)
                (0.90000 0.00000 0.11429)
                (0.90000 0.00000 0.12773)
                (0.90000 0.00000 0.14118)
                (0.90000 0.00000 0.15462)
                (0.90000 0.00000 0.16807)
                (0.90000 0.00000 0.18151)
                (0.90000 0.00000 0.19496)
                (0.90000 0.00000 0.20840)
                (0.90000 0.00000 0.22185)
                (0.90000 0.00000 0.23529)
                (0.90000 0.00000 0.24874)
                (0.90000 0.00000 0.26218)
                (0.90000 0.00000 0.27563)
                (0.90000 0.00000 0.28908)
                (0.90000 0.00000 0.30252)
                (0.90000 0.00000 0.31597)
                (0.90000 0.00000 0.32941)
                (0.90000 0.00000 0.34286)
                (0.90000 0.00000 0.35630)
                (0.90000 0.00000 0.36975)
                (0.90000 0.00000 0.38319)
                (0.90000 0.00000 0.39664)
                (0.90000 0.00000 0.41008)
                (0.90000 0.00000 0.42353)
                (0.90000 0.00000 0.43697)
                (0.90000 0.00000 0.45042)
                (0.90000 0.00000 0.46387)
                (0.90000 0.00000 0.47731)
                (0.90000 0.00000 0.49076)
                (0.90000 0.00000 0.50420)
                (0.90000 0.00000 0.51765)
                (0.90000 0.00000 0.53109)
                (0.90000 0.00000 0.54454)
                (0.90000 0.00000 0.55798)
                (0.90000 0.00000 0.57143)
                (0.90000 0.00000 0.58487)
                (0.90000 0.00000 0.59832)
                (0.90000 0.00000 0.61176)
                (0.90000 0.00000 0.62521)
                (0.90000 0.00000 0.63866)
                (0.90000 0.00000 0.65210)
                (0.90000 0.00000 0.66555)
                (0.90000 0.00000 0.67899)
                (0.90000 0.00000 0.69244)
                (0.90000 0.00000 0.70588)
                (0.90000 0.00000 0.71933)
                (0.90000 0.00000 0.73277)
                (0.90000 0.00000 0.74622)
                (0.90000 0.00000 0.75966)
                (0.90000 0.00000 0.77311)
                (0.90000 0.00000 0.78655)
                (0.90000 0.00000 0.80000)
            );
        }
    }
}
// ************************************************************************* //
