case/system/functions/upstreamProbes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/functions";
    object      upstreamProbes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Time-resolved velocity/pressure upstream of the rotor ("air resistance in front
// of the windmill"): on the axis and at 70 % span height, from 2R to 0.25R upstream.
upstreamProbes
{
    type            probes;
    libs            (sampling);
    writeControl    timeStep;
    writeInterval   1;
    fields          (U p);
    probeLocations
    (
        (-0.900 0 0) (-0.450 0 0) (-0.225 0 0) (-0.1125 0 0)       // axis: -2R -R -R/2 -R/4
        (-0.900 0 0.315) (-0.450 0 0.315) (-0.225 0 0.315) (-0.1125 0 0.315) // r = 0.7R
        ( 0.900 0 0.315) ( 1.800 0 0.315)                         // wake: +2R, +4R
    );
}
// ************************************************************************* //
